Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/uhphs.h
/* -------- UHPHS_FRINDEX : (UHPHS Offset: 0x1C) (R/W 32) UHPHS USB Frame Index Register -------- */
#define UHPHS_FRINDEX_FI_Pos                  _U_(0)                                               /**< (UHPHS_FRINDEX) Frame Index Position */
#define UHPHS_FRINDEX_FI_Msk                  (_U_(0x3FFF) << UHPHS_FRINDEX_FI_Pos)                /**< (UHPHS_FRINDEX) Frame Index Mask */
#define UHPHS_FRINDEX_FI(value)               (UHPHS_FRINDEX_FI_Msk & ((value) << UHPHS_FRINDEX_FI_Pos))
#define UHPHS_FRINDEX_Msk                     _U_(0x00003FFF)                                      /**< (UHPHS_FRINDEX) Register Mask  */


/* -------- UHPHS_CTRLDSSEGMENT : (UHPHS Offset: 0x20) (R/W 32) UHPHS Control Data Structure Segment Register -------- */
#define UHPHS_CTRLDSSEGMENT_Msk               _U_(0x00000000)                                      /**< (UHPHS_CTRLDSSEGMENT) Register Mask  */


/* -------- UHPHS_PERIODICLISTBASE : (UHPHS Offset: 0x24) (R/W 32) UHPHS Periodic Frame List Base Address Register -------- */
#define UHPHS_PERIODICLISTBASE_BA_Pos         _U_(12)                                              /**< (UHPHS_PERIODICLISTBASE) Base Address (Low) Position */
#define UHPHS_PERIODICLISTBASE_BA_Msk         (_U_(0xFFFFF) << UHPHS_PERIODICLISTBASE_BA_Pos)      /**< (UHPHS_PERIODICLISTBASE) Base Address (Low) Mask */
#define UHPHS_PERIODICLISTBASE_BA(value)      (UHPHS_PERIODICLISTBASE_BA_Msk & ((value) << UHPHS_PERIODICLISTBASE_BA_Pos))
#define UHPHS_PERIODICLISTBASE_Msk            _U_(0xFFFFF000)                                      /**< (UHPHS_PERIODICLISTBASE) Register Mask  */


/* -------- UHPHS_ASYNCLISTADDR : (UHPHS Offset: 0x28) (R/W 32) UHPHS Asynchronous List Address Register -------- */
#define UHPHS_ASYNCLISTADDR_LPL_Pos           _U_(5)                                               /**< (UHPHS_ASYNCLISTADDR) Link Pointer Low Position */
#define UHPHS_ASYNCLISTADDR_LPL_Msk           (_U_(0x7FFFFFF) << UHPHS_ASYNCLISTADDR_LPL_Pos)      /**< (UHPHS_ASYNCLISTADDR) Link Pointer Low Mask */
#define UHPHS_ASYNCLISTADDR_LPL(value)        (UHPHS_ASYNCLISTADDR_LPL_Msk & ((value) << UHPHS_ASYNCLISTADDR_LPL_Pos))
#define UHPHS_ASYNCLISTADDR_Msk               _U_(0xFFFFFFE0)                                      /**< (UHPHS_ASYNCLISTADDR) Register Mask  */


/* -------- UHPHS_CONFIGFLAG : (UHPHS Offset: 0x50) (R/W 32) UHPHS Configured Flag Register -------- */
#define UHPHS_CONFIGFLAG_CF_Pos               _U_(0)                                               /**< (UHPHS_CONFIGFLAG) Configure Flag (Read/Write) Position */
#define UHPHS_CONFIGFLAG_CF_Msk               (_U_(0x1) << UHPHS_CONFIGFLAG_CF_Pos)                /**< (UHPHS_CONFIGFLAG) Configure Flag (Read/Write) Mask */
#define UHPHS_CONFIGFLAG_CF(value)            (UHPHS_CONFIGFLAG_CF_Msk & ((value) << UHPHS_CONFIGFLAG_CF_Pos))
#define UHPHS_CONFIGFLAG_Msk                  _U_(0x00000001)                                      /**< (UHPHS_CONFIGFLAG) Register Mask  */


/* -------- UHPHS_PORTSC : (UHPHS Offset: 0x54) (R/W 32) UHPHS Port Status and Control Register (port = 0) -------- */
#define UHPHS_PORTSC_CCS_Pos                  _U_(0)                                               /**< (UHPHS_PORTSC) Current Connect Status (read-only) Position */
#define UHPHS_PORTSC_CCS_Msk                  (_U_(0x1) << UHPHS_PORTSC_CCS_Pos)                   /**< (UHPHS_PORTSC) Current Connect Status (read-only) Mask */
#define UHPHS_PORTSC_CCS(value)               (UHPHS_PORTSC_CCS_Msk & ((value) << UHPHS_PORTSC_CCS_Pos))
#define UHPHS_PORTSC_CSC_Pos                  _U_(1)                                               /**< (UHPHS_PORTSC) Connect Status Change (read/write clear) Position */
#define UHPHS_PORTSC_CSC_Msk                  (_U_(0x1) << UHPHS_PORTSC_CSC_Pos)                   /**< (UHPHS_PORTSC) Connect Status Change (read/write clear) Mask */
#define UHPHS_PORTSC_CSC(value)               (UHPHS_PORTSC_CSC_Msk & ((value) << UHPHS_PORTSC_CSC_Pos))
#define UHPHS_PORTSC_PED_Pos                  _U_(2)                                               /**< (UHPHS_PORTSC) Port Enabled/Disabled (read/write) Position */
#define UHPHS_PORTSC_PED_Msk                  (_U_(0x1) << UHPHS_PORTSC_PED_Pos)                   /**< (UHPHS_PORTSC) Port Enabled/Disabled (read/write) Mask */
#define UHPHS_PORTSC_PED(value)               (UHPHS_PORTSC_PED_Msk & ((value) << UHPHS_PORTSC_PED_Pos))
#define UHPHS_PORTSC_PEDC_Pos                 _U_(3)                                               /**< (UHPHS_PORTSC) Port Enable/Disable Change (read/write clear) Position */
#define UHPHS_PORTSC_PEDC_Msk                 (_U_(0x1) << UHPHS_PORTSC_PEDC_Pos)                  /**< (UHPHS_PORTSC) Port Enable/Disable Change (read/write clear) Mask */
#define UHPHS_PORTSC_PEDC(value)              (UHPHS_PORTSC_PEDC_Msk & ((value) << UHPHS_PORTSC_PEDC_Pos))
#define UHPHS_PORTSC_OCA_Pos                  _U_(4)                                               /**< (UHPHS_PORTSC) Over-current Active (read-only) Position */
#define UHPHS_PORTSC_OCA_Msk                  (_U_(0x1) << UHPHS_PORTSC_OCA_Pos)                   /**< (UHPHS_PORTSC) Over-current Active (read-only) Mask */
#define UHPHS_PORTSC_OCA(value)               (UHPHS_PORTSC_OCA_Msk & ((value) << UHPHS_PORTSC_OCA_Pos))
#define UHPHS_PORTSC_OCC_Pos                  _U_(5)                                               /**< (UHPHS_PORTSC) Over-current Change (read/write clear) Position */
#define UHPHS_PORTSC_OCC_Msk                  (_U_(0x1) << UHPHS_PORTSC_OCC_Pos)                   /**< (UHPHS_PORTSC) Over-current Change (read/write clear) Mask */
#define UHPHS_PORTSC_OCC(value)               (UHPHS_PORTSC_OCC_Msk & ((value) << UHPHS_PORTSC_OCC_Pos))
#define UHPHS_PORTSC_FPR_Pos                  _U_(6)                                               /**< (UHPHS_PORTSC) Force Port Resume (read/write) Position */
#define UHPHS_PORTSC_FPR_Msk                  (_U_(0x1) << UHPHS_PORTSC_FPR_Pos)                   /**< (UHPHS_PORTSC) Force Port Resume (read/write) Mask */
#define UHPHS_PORTSC_FPR(value)               (UHPHS_PORTSC_FPR_Msk & ((value) << UHPHS_PORTSC_FPR_Pos))
#define UHPHS_PORTSC_SUS_Pos                  _U_(7)                                               /**< (UHPHS_PORTSC) Suspend (read/write) Position */
#define UHPHS_PORTSC_SUS_Msk                  (_U_(0x1) << UHPHS_PORTSC_SUS_Pos)                   /**< (UHPHS_PORTSC) Suspend (read/write) Mask */
#define UHPHS_PORTSC_SUS(value)               (UHPHS_PORTSC_SUS_Msk & ((value) << UHPHS_PORTSC_SUS_Pos))
#define UHPHS_PORTSC_PR_Pos                   _U_(8)                                               /**< (UHPHS_PORTSC) Port Reset (read/write) Position */
#define UHPHS_PORTSC_PR_Msk                   (_U_(0x1) << UHPHS_PORTSC_PR_Pos)                    /**< (UHPHS_PORTSC) Port Reset (read/write) Mask */
#define UHPHS_PORTSC_PR(value)                (UHPHS_PORTSC_PR_Msk & ((value) << UHPHS_PORTSC_PR_Pos))
#define UHPHS_PORTSC_LS_Pos                   _U_(10)                                              /**< (UHPHS_PORTSC) Line Status (read-only) Position */
#define UHPHS_PORTSC_LS_Msk                   (_U_(0x3) << UHPHS_PORTSC_LS_Pos)                    /**< (UHPHS_PORTSC) Line Status (read-only) Mask */
#define UHPHS_PORTSC_LS(value)                (UHPHS_PORTSC_LS_Msk & ((value) << UHPHS_PORTSC_LS_Pos))
#define   UHPHS_PORTSC_LS_SE0_Val             _U_(0x0)                                             /**< (UHPHS_PORTSC) Not a low-speed device, perform EHCI reset  */
#define   UHPHS_PORTSC_LS_K_STATE_Val         _U_(0x1)                                             /**< (UHPHS_PORTSC) Low-speed device, release ownership of port  */
#define   UHPHS_PORTSC_LS_J_STATE_Val         _U_(0x2)                                             /**< (UHPHS_PORTSC) Not a low-speed device, perform EHCI reset  */
#define   UHPHS_PORTSC_LS_UNDEFINED_Val       _U_(0x3)                                             /**< (UHPHS_PORTSC) Not a low-speed device, perform EHCI reset  */
#define UHPHS_PORTSC_LS_SE0                   (UHPHS_PORTSC_LS_SE0_Val << UHPHS_PORTSC_LS_Pos)     /**< (UHPHS_PORTSC) Not a low-speed device, perform EHCI reset Position  */
#define UHPHS_PORTSC_LS_K_STATE               (UHPHS_PORTSC_LS_K_STATE_Val << UHPHS_PORTSC_LS_Pos) /**< (UHPHS_PORTSC) Low-speed device, release ownership of port Position  */
#define UHPHS_PORTSC_LS_J_STATE               (UHPHS_PORTSC_LS_J_STATE_Val << UHPHS_PORTSC_LS_Pos) /**< (UHPHS_PORTSC) Not a low-speed device, perform EHCI reset Position  */
#define UHPHS_PORTSC_LS_UNDEFINED             (UHPHS_PORTSC_LS_UNDEFINED_Val << UHPHS_PORTSC_LS_Pos) /**< (UHPHS_PORTSC) Not a low-speed device, perform EHCI reset Position  */
#define UHPHS_PORTSC_PP_Pos                   _U_(12)                                              /**< (UHPHS_PORTSC) Port Power (read/write or read-only) Position */
#define UHPHS_PORTSC_PP_Msk                   (_U_(0x1) << UHPHS_PORTSC_PP_Pos)                    /**< (UHPHS_PORTSC) Port Power (read/write or read-only) Mask */
#define UHPHS_PORTSC_PP(value)                (UHPHS_PORTSC_PP_Msk & ((value) << UHPHS_PORTSC_PP_Pos))
#define UHPHS_PORTSC_PO_Pos                   _U_(13)                                              /**< (UHPHS_PORTSC) Port Owner (read/write) Position */
#define UHPHS_PORTSC_PO_Msk                   (_U_(0x1) << UHPHS_PORTSC_PO_Pos)                    /**< (UHPHS_PORTSC) Port Owner (read/write) Mask */
#define UHPHS_PORTSC_PO(value)                (UHPHS_PORTSC_PO_Msk & ((value) << UHPHS_PORTSC_PO_Pos))
#define UHPHS_PORTSC_PIC_Pos                  _U_(14)                                              /**< (UHPHS_PORTSC) Port Indicator Control (read/write) Position */
#define UHPHS_PORTSC_PIC_Msk                  (_U_(0x3) << UHPHS_PORTSC_PIC_Pos)                   /**< (UHPHS_PORTSC) Port Indicator Control (read/write) Mask */
#define UHPHS_PORTSC_PIC(value)               (UHPHS_PORTSC_PIC_Msk & ((value) << UHPHS_PORTSC_PIC_Pos))
#define UHPHS_PORTSC_PTC_Pos                  _U_(16)                                              /**< (UHPHS_PORTSC) Port Test Control (read/write) Position */
#define UHPHS_PORTSC_PTC_Msk                  (_U_(0xF) << UHPHS_PORTSC_PTC_Pos)                   /**< (UHPHS_PORTSC) Port Test Control (read/write) Mask */
#define UHPHS_PORTSC_PTC(value)               (UHPHS_PORTSC_PTC_Msk & ((value) << UHPHS_PORTSC_PTC_Pos))
#define UHPHS_PORTSC_WKCNNT_E_Pos             _U_(20)                                              /**< (UHPHS_PORTSC) Wake on Connect Enable (read/write) Position */
#define UHPHS_PORTSC_WKCNNT_E_Msk             (_U_(0x1) << UHPHS_PORTSC_WKCNNT_E_Pos)              /**< (UHPHS_PORTSC) Wake on Connect Enable (read/write) Mask */
#define UHPHS_PORTSC_WKCNNT_E(value)          (UHPHS_PORTSC_WKCNNT_E_Msk & ((value) << UHPHS_PORTSC_WKCNNT_E_Pos))
#define UHPHS_PORTSC_WKDSCNNT_E_Pos           _U_(21)                                              /**< (UHPHS_PORTSC) Wake on Disconnect Enable (read/write) Position */
#define UHPHS_PORTSC_WKDSCNNT_E_Msk           (_U_(0x1) << UHPHS_PORTSC_WKDSCNNT_E_Pos)            /**< (UHPHS_PORTSC) Wake on Disconnect Enable (read/write) Mask */
#define UHPHS_PORTSC_WKDSCNNT_E(value)        (UHPHS_PORTSC_WKDSCNNT_E_Msk & ((value) << UHPHS_PORTSC_WKDSCNNT_E_Pos))
#define UHPHS_PORTSC_WKOC_E_Pos               _U_(22)                                              /**< (UHPHS_PORTSC) Wake on Over-current Enable (read/write) Position */
#define UHPHS_PORTSC_WKOC_E_Msk               (_U_(0x1) << UHPHS_PORTSC_WKOC_E_Pos)                /**< (UHPHS_PORTSC) Wake on Over-current Enable (read/write) Mask */
#define UHPHS_PORTSC_WKOC_E(value)            (UHPHS_PORTSC_WKOC_E_Msk & ((value) << UHPHS_PORTSC_WKOC_E_Pos))
#define UHPHS_PORTSC_Msk                      _U_(0x007FFDFF)                                      /**< (UHPHS_PORTSC) Register Mask  */


/* -------- UHPHS_INSNREG00 : (UHPHS Offset: 0x90) (R/W 32) EHCI Specific Registers 00 -------- */
#define UHPHS_INSNREG00_En_Pos                _U_(0)                                               /**< (UHPHS_INSNREG00) Enable Programmable Microframe Base Value Position */
#define UHPHS_INSNREG00_En_Msk                (_U_(0x1) << UHPHS_INSNREG00_En_Pos)                 /**< (UHPHS_INSNREG00) Enable Programmable Microframe Base Value Mask */
#define UHPHS_INSNREG00_En(value)             (UHPHS_INSNREG00_En_Msk & ((value) << UHPHS_INSNREG00_En_Pos))
#define UHPHS_INSNREG00_MFC_16_Pos            _U_(1)                                               /**< (UHPHS_INSNREG00) Microframe Counter with Word Byte Interface Position */
#define UHPHS_INSNREG00_MFC_16_Msk            (_U_(0x7FF) << UHPHS_INSNREG00_MFC_16_Pos)           /**< (UHPHS_INSNREG00) Microframe Counter with Word Byte Interface Mask */
#define UHPHS_INSNREG00_MFC_16(value)         (UHPHS_INSNREG00_MFC_16_Msk & ((value) << UHPHS_INSNREG00_MFC_16_Pos))
#define UHPHS_INSNREG00_MFC_8_Pos             _U_(12)                                              /**< (UHPHS_INSNREG00) Microframe Counter with Byte Interface Position */
#define UHPHS_INSNREG00_MFC_8_Msk             (_U_(0x3) << UHPHS_INSNREG00_MFC_8_Pos)              /**< (UHPHS_INSNREG00) Microframe Counter with Byte Interface Mask */
#define UHPHS_INSNREG00_MFC_8(value)          (UHPHS_INSNREG00_MFC_8_Msk & ((value) << UHPHS_INSNREG00_MFC_8_Pos))
#define UHPHS_INSNREG00_Debug_Pos             _U_(14)                                              /**< (UHPHS_INSNREG00) Debug Purposes Position */
#define UHPHS_INSNREG00_Debug_Msk             (_U_(0x3F) << UHPHS_INSNREG00_Debug_Pos)             /**< (UHPHS_INSNREG00) Debug Purposes Mask */
#define UHPHS_INSNREG00_Debug(value)          (UHPHS_INSNREG00_Debug_Msk & ((value) << UHPHS_INSNREG00_Debug_Pos))
#define UHPHS_INSNREG00_Msk                   _U_(0x000FFFFF)                                      /**< (UHPHS_INSNREG00) Register Mask  */


/* -------- UHPHS_INSNREG01 : (UHPHS Offset: 0x94) (R/W 32) EHCI Specific Registers 01 -------- */
#define UHPHS_INSNREG01_In_Threshold_Pos      _U_(0)                                               /**< (UHPHS_INSNREG01) Amount of Data Available in the IN Packet Buffer Position */
#define UHPHS_INSNREG01_In_Threshold_Msk      (_U_(0xFFFF) << UHPHS_INSNREG01_In_Threshold_Pos)    /**< (UHPHS_INSNREG01) Amount of Data Available in the IN Packet Buffer Mask */
#define UHPHS_INSNREG01_In_Threshold(value)   (UHPHS_INSNREG01_In_Threshold_Msk & ((value) << UHPHS_INSNREG01_In_Threshold_Pos))
#define UHPHS_INSNREG01_Out_Threshold_Pos     _U_(16)                                              /**< (UHPHS_INSNREG01) Amount of Data Available in the OUT Packet Buffer Position */
#define UHPHS_INSNREG01_Out_Threshold_Msk     (_U_(0xFFFF) << UHPHS_INSNREG01_Out_Threshold_Pos)   /**< (UHPHS_INSNREG01) Amount of Data Available in the OUT Packet Buffer Mask */
#define UHPHS_INSNREG01_Out_Threshold(value)  (UHPHS_INSNREG01_Out_Threshold_Msk & ((value) << UHPHS_INSNREG01_Out_Threshold_Pos))
#define UHPHS_INSNREG01_Msk                   _U_(0xFFFFFFFF)                                      /**< (UHPHS_INSNREG01) Register Mask  */


/* -------- UHPHS_INSNREG02 : (UHPHS Offset: 0x98) (R/W 32) EHCI Specific Registers 02 -------- */
#define UHPHS_INSNREG02_Dwords_Pos            _U_(0)                                               /**< (UHPHS_INSNREG02) Number of Entries Position */
#define UHPHS_INSNREG02_Dwords_Msk            (_U_(0xFFF) << UHPHS_INSNREG02_Dwords_Pos)           /**< (UHPHS_INSNREG02) Number of Entries Mask */
#define UHPHS_INSNREG02_Dwords(value)         (UHPHS_INSNREG02_Dwords_Msk & ((value) << UHPHS_INSNREG02_Dwords_Pos))
#define UHPHS_INSNREG02_Msk                   _U_(0x00000FFF)                                      /**< (UHPHS_INSNREG02) Register Mask  */


/* -------- UHPHS_INSNREG03 : (UHPHS Offset: 0x9C) (R/W 32) EHCI Specific Registers 03 -------- */
#define UHPHS_INSNREG03_Break_Mem_Pos         _U_(0)                                               /**< (UHPHS_INSNREG03) Break Memory Transfer (in CONFIG1 mode only, not applicable in CONFIG2 mode) Position */
#define UHPHS_INSNREG03_Break_Mem_Msk         (_U_(0x1) << UHPHS_INSNREG03_Break_Mem_Pos)          /**< (UHPHS_INSNREG03) Break Memory Transfer (in CONFIG1 mode only, not applicable in CONFIG2 mode) Mask */
#define UHPHS_INSNREG03_Break_Mem(value)      (UHPHS_INSNREG03_Break_Mem_Msk & ((value) << UHPHS_INSNREG03_Break_Mem_Pos))
#define UHPHS_INSNREG03_TA_Offset_Pos         _U_(1)                                               /**< (UHPHS_INSNREG03) Time-Available Offset Position */
#define UHPHS_INSNREG03_TA_Offset_Msk         (_U_(0xFF) << UHPHS_INSNREG03_TA_Offset_Pos)         /**< (UHPHS_INSNREG03) Time-Available Offset Mask */
#define UHPHS_INSNREG03_TA_Offset(value)      (UHPHS_INSNREG03_TA_Offset_Msk & ((value) << UHPHS_INSNREG03_TA_Offset_Pos))
#define UHPHS_INSNREG03_Per_Frame_Pos         _U_(9)                                               /**< (UHPHS_INSNREG03) Periodic Frame List Fetch Position */
#define UHPHS_INSNREG03_Per_Frame_Msk         (_U_(0x1) << UHPHS_INSNREG03_Per_Frame_Pos)          /**< (UHPHS_INSNREG03) Periodic Frame List Fetch Mask */
#define UHPHS_INSNREG03_Per_Frame(value)      (UHPHS_INSNREG03_Per_Frame_Msk & ((value) << UHPHS_INSNREG03_Per_Frame_Pos))
#define UHPHS_INSNREG03_T03_Tx_Pos            _U_(10)                                              /**< (UHPHS_INSNREG03) Transmit to Transmit Turnaround Delay Add-on Position */
#define UHPHS_INSNREG03_T03_Tx_Msk            (_U_(0x7) << UHPHS_INSNREG03_T03_Tx_Pos)             /**< (UHPHS_INSNREG03) Transmit to Transmit Turnaround Delay Add-on Mask */
#define UHPHS_INSNREG03_T03_Tx(value)         (UHPHS_INSNREG03_T03_Tx_Msk & ((value) << UHPHS_INSNREG03_T03_Tx_Pos))
#define UHPHS_INSNREG03_Ignore_LS_Pos         _U_(13)                                              /**< (UHPHS_INSNREG03) Ignore Linestate During TestSE0 NAK Position */
#define UHPHS_INSNREG03_Ignore_LS_Msk         (_U_(0x1) << UHPHS_INSNREG03_Ignore_LS_Pos)          /**< (UHPHS_INSNREG03) Ignore Linestate During TestSE0 NAK Mask */
#define UHPHS_INSNREG03_Ignore_LS(value)      (UHPHS_INSNREG03_Ignore_LS_Msk & ((value) << UHPHS_INSNREG03_Ignore_LS_Pos))
#define UHPHS_INSNREG03_EN_CK256_Pos          _U_(14)                                              /**< (UHPHS_INSNREG03) Enable 256 Clock Checking Position */
#define UHPHS_INSNREG03_EN_CK256_Msk          (_U_(0x1) << UHPHS_INSNREG03_EN_CK256_Pos)           /**< (UHPHS_INSNREG03) Enable 256 Clock Checking Mask */
#define UHPHS_INSNREG03_EN_CK256(value)       (UHPHS_INSNREG03_EN_CK256_Msk & ((value) << UHPHS_INSNREG03_EN_CK256_Pos))
#define UHPHS_INSNREG03_Msk                   _U_(0x00007FFF)                                      /**< (UHPHS_INSNREG03) Register Mask  */

