Microchip-MPLAB-Harmony/csp/apps/pit/led_toggle_polling/firmware/src/packs/ATSAM9X60_DFP/component/uhphs.h
#define UHPHS_INSNREG03_EN_CK_Pos             _U_(14)                                              /**< (UHPHS_INSNREG03 Position) Enable 256 Clock Checking */
#define UHPHS_INSNREG03_EN_CK_Msk             (_U_(0x1) << UHPHS_INSNREG03_EN_CK_Pos)              /**< (UHPHS_INSNREG03 Mask) EN_CK */
#define UHPHS_INSNREG03_EN_CK(value)          (UHPHS_INSNREG03_EN_CK_Msk & ((value) << UHPHS_INSNREG03_EN_CK_Pos)) 

/* -------- UHPHS_INSNREG04 : (UHPHS Offset: 0xA0) (R/W 32) EHCI Specific Registers 04 -------- */
#define UHPHS_INSNREG04_HCSPARAMS_W_Pos       _U_(0)                                               /**< (UHPHS_INSNREG04) HCSPARAMS Write Position */
#define UHPHS_INSNREG04_HCSPARAMS_W_Msk       (_U_(0x1) << UHPHS_INSNREG04_HCSPARAMS_W_Pos)        /**< (UHPHS_INSNREG04) HCSPARAMS Write Mask */
#define UHPHS_INSNREG04_HCSPARAMS_W(value)    (UHPHS_INSNREG04_HCSPARAMS_W_Msk & ((value) << UHPHS_INSNREG04_HCSPARAMS_W_Pos))
#define UHPHS_INSNREG04_HCCPARAMS_BW_Pos      _U_(1)                                               /**< (UHPHS_INSNREG04) HCCPARAMS Bits Write Position */
#define UHPHS_INSNREG04_HCCPARAMS_BW_Msk      (_U_(0x1) << UHPHS_INSNREG04_HCCPARAMS_BW_Pos)       /**< (UHPHS_INSNREG04) HCCPARAMS Bits Write Mask */
#define UHPHS_INSNREG04_HCCPARAMS_BW(value)   (UHPHS_INSNREG04_HCCPARAMS_BW_Msk & ((value) << UHPHS_INSNREG04_HCCPARAMS_BW_Pos))
#define UHPHS_INSNREG04_SDPE_TIME_Pos         _U_(2)                                               /**< (UHPHS_INSNREG04) Scales Down Port Enumeration Time Position */
#define UHPHS_INSNREG04_SDPE_TIME_Msk         (_U_(0x1) << UHPHS_INSNREG04_SDPE_TIME_Pos)          /**< (UHPHS_INSNREG04) Scales Down Port Enumeration Time Mask */
#define UHPHS_INSNREG04_SDPE_TIME(value)      (UHPHS_INSNREG04_SDPE_TIME_Msk & ((value) << UHPHS_INSNREG04_SDPE_TIME_Pos))
#define UHPHS_INSNREG04_NAK_RF_Pos            _U_(4)                                               /**< (UHPHS_INSNREG04) NAK Reload Fix (Read/Write) Position */
#define UHPHS_INSNREG04_NAK_RF_Msk            (_U_(0x1) << UHPHS_INSNREG04_NAK_RF_Pos)             /**< (UHPHS_INSNREG04) NAK Reload Fix (Read/Write) Mask */
#define UHPHS_INSNREG04_NAK_RF(value)         (UHPHS_INSNREG04_NAK_RF_Msk & ((value) << UHPHS_INSNREG04_NAK_RF_Pos))
#define UHPHS_INSNREG04_EN_AutoFunc_Pos       _U_(5)                                               /**< (UHPHS_INSNREG04) Enable Automatic Feature Position */
#define UHPHS_INSNREG04_EN_AutoFunc_Msk       (_U_(0x1) << UHPHS_INSNREG04_EN_AutoFunc_Pos)        /**< (UHPHS_INSNREG04) Enable Automatic Feature Mask */
#define UHPHS_INSNREG04_EN_AutoFunc(value)    (UHPHS_INSNREG04_EN_AutoFunc_Msk & ((value) << UHPHS_INSNREG04_EN_AutoFunc_Pos))
#define UHPHS_INSNREG04_Msk                   _U_(0x00000037)                                      /**< (UHPHS_INSNREG04) Register Mask  */


/* -------- UHPHS_INSNREG05 : (UHPHS Offset: 0xA4) (R/W 32) EHCI Specific Registers 05 -------- */
#define UHPHS_INSNREG05_VStatus_Pos           _U_(0)                                               /**< (UHPHS_INSNREG05) Vendor Status (Read-only) Position */
#define UHPHS_INSNREG05_VStatus_Msk           (_U_(0xFF) << UHPHS_INSNREG05_VStatus_Pos)           /**< (UHPHS_INSNREG05) Vendor Status (Read-only) Mask */
#define UHPHS_INSNREG05_VStatus(value)        (UHPHS_INSNREG05_VStatus_Msk & ((value) << UHPHS_INSNREG05_VStatus_Pos))
#define UHPHS_INSNREG05_VControl_Pos          _U_(8)                                               /**< (UHPHS_INSNREG05) Vendor Control (Read/Write) Position */
#define UHPHS_INSNREG05_VControl_Msk          (_U_(0xF) << UHPHS_INSNREG05_VControl_Pos)           /**< (UHPHS_INSNREG05) Vendor Control (Read/Write) Mask */
#define UHPHS_INSNREG05_VControl(value)       (UHPHS_INSNREG05_VControl_Msk & ((value) << UHPHS_INSNREG05_VControl_Pos))
#define UHPHS_INSNREG05_VControlLoadM_Pos     _U_(12)                                              /**< (UHPHS_INSNREG05) Vendor Control Load Microframe (Read/Write) Position */
#define UHPHS_INSNREG05_VControlLoadM_Msk     (_U_(0x1) << UHPHS_INSNREG05_VControlLoadM_Pos)      /**< (UHPHS_INSNREG05) Vendor Control Load Microframe (Read/Write) Mask */
#define UHPHS_INSNREG05_VControlLoadM(value)  (UHPHS_INSNREG05_VControlLoadM_Msk & ((value) << UHPHS_INSNREG05_VControlLoadM_Pos))
#define UHPHS_INSNREG05_VPort_Pos             _U_(13)                                              /**< (UHPHS_INSNREG05) Vendor Port (Read/Write) Position */
#define UHPHS_INSNREG05_VPort_Msk             (_U_(0xF) << UHPHS_INSNREG05_VPort_Pos)              /**< (UHPHS_INSNREG05) Vendor Port (Read/Write) Mask */
#define UHPHS_INSNREG05_VPort(value)          (UHPHS_INSNREG05_VPort_Msk & ((value) << UHPHS_INSNREG05_VPort_Pos))
#define UHPHS_INSNREG05_VBusy_Pos             _U_(17)                                              /**< (UHPHS_INSNREG05) Vendor Busy (Read-only) Position */
#define UHPHS_INSNREG05_VBusy_Msk             (_U_(0x1) << UHPHS_INSNREG05_VBusy_Pos)              /**< (UHPHS_INSNREG05) Vendor Busy (Read-only) Mask */
#define UHPHS_INSNREG05_VBusy(value)          (UHPHS_INSNREG05_VBusy_Msk & ((value) << UHPHS_INSNREG05_VBusy_Pos))
#define UHPHS_INSNREG05_Msk                   _U_(0x0003FFFF)                                      /**< (UHPHS_INSNREG05) Register Mask  */


/* -------- UHPHS_INSNREG06 : (UHPHS Offset: 0xA8) (R/W 32) EHCI Specific Registers 06 -------- */
#define UHPHS_INSNREG06_Nb_Success_Burst_Pos  _U_(0)                                               /**< (UHPHS_INSNREG06) Number of Successful Bursts (Read-only)(1) Position */
#define UHPHS_INSNREG06_Nb_Success_Burst_Msk  (_U_(0xF) << UHPHS_INSNREG06_Nb_Success_Burst_Pos)   /**< (UHPHS_INSNREG06) Number of Successful Bursts (Read-only)(1) Mask */
#define UHPHS_INSNREG06_Nb_Success_Burst(value) (UHPHS_INSNREG06_Nb_Success_Burst_Msk & ((value) << UHPHS_INSNREG06_Nb_Success_Burst_Pos))
#define UHPHS_INSNREG06_Nb_Burst_Pos          _U_(4)                                               /**< (UHPHS_INSNREG06) Number of Bursts (Read-only)(1) Position */
#define UHPHS_INSNREG06_Nb_Burst_Msk          (_U_(0x1F) << UHPHS_INSNREG06_Nb_Burst_Pos)          /**< (UHPHS_INSNREG06) Number of Bursts (Read-only)(1) Mask */
#define UHPHS_INSNREG06_Nb_Burst(value)       (UHPHS_INSNREG06_Nb_Burst_Msk & ((value) << UHPHS_INSNREG06_Nb_Burst_Pos))
#define UHPHS_INSNREG06_HBURST_Pos            _U_(9)                                               /**< (UHPHS_INSNREG06) Burst Value (Read-only)(1) Position */
#define UHPHS_INSNREG06_HBURST_Msk            (_U_(0x7) << UHPHS_INSNREG06_HBURST_Pos)             /**< (UHPHS_INSNREG06) Burst Value (Read-only)(1) Mask */
#define UHPHS_INSNREG06_HBURST(value)         (UHPHS_INSNREG06_HBURST_Msk & ((value) << UHPHS_INSNREG06_HBURST_Pos))
#define UHPHS_INSNREG06_AHB_ERR_Pos           _U_(31)                                              /**< (UHPHS_INSNREG06) AHB Error Position */
#define UHPHS_INSNREG06_AHB_ERR_Msk           (_U_(0x1) << UHPHS_INSNREG06_AHB_ERR_Pos)            /**< (UHPHS_INSNREG06) AHB Error Mask */
#define UHPHS_INSNREG06_AHB_ERR(value)        (UHPHS_INSNREG06_AHB_ERR_Msk & ((value) << UHPHS_INSNREG06_AHB_ERR_Pos))
#define UHPHS_INSNREG06_Msk                   _U_(0x80000FFF)                                      /**< (UHPHS_INSNREG06) Register Mask  */


/* -------- UHPHS_INSNREG07 : (UHPHS Offset: 0xAC) (R/W 32) EHCI Specific Registers 07 -------- */
#define UHPHS_INSNREG07_AHB_ADDR_Pos          _U_(0)                                               /**< (UHPHS_INSNREG07) AHB Address (Read Only) Position */
#define UHPHS_INSNREG07_AHB_ADDR_Msk          (_U_(0xFFFFFFFF) << UHPHS_INSNREG07_AHB_ADDR_Pos)    /**< (UHPHS_INSNREG07) AHB Address (Read Only) Mask */
#define UHPHS_INSNREG07_AHB_ADDR(value)       (UHPHS_INSNREG07_AHB_ADDR_Msk & ((value) << UHPHS_INSNREG07_AHB_ADDR_Pos))
#define UHPHS_INSNREG07_Msk                   _U_(0xFFFFFFFF)                                      /**< (UHPHS_INSNREG07) Register Mask  */


/** \brief UHPHS register offsets definitions */
#define UHPHS_HCCAPBASE_REG_OFST       (0x00)              /**< (UHPHS_HCCAPBASE) UHPHS Host Controller Capability Register Offset */
#define UHPHS_HCSPARAMS_REG_OFST       (0x04)              /**< (UHPHS_HCSPARAMS) UHPHS Host Controller Structural Parameters Register Offset */
#define UHPHS_HCCPARAMS_REG_OFST       (0x08)              /**< (UHPHS_HCCPARAMS) UHPHS Host Controller Capability Parameters Register Offset */
#define UHPHS_USBCMD_REG_OFST          (0x10)              /**< (UHPHS_USBCMD) UHPHS USB Command Register Offset */
#define UHPHS_USBSTS_REG_OFST          (0x14)              /**< (UHPHS_USBSTS) UHPHS USB Status Register Offset */
#define UHPHS_USBINTR_REG_OFST         (0x18)              /**< (UHPHS_USBINTR) UHPHS USB Interrupt Enable Register Offset */
#define UHPHS_FRINDEX_REG_OFST         (0x1C)              /**< (UHPHS_FRINDEX) UHPHS USB Frame Index Register Offset */
#define UHPHS_CTRLDSSEGMENT_REG_OFST   (0x20)              /**< (UHPHS_CTRLDSSEGMENT) UHPHS Control Data Structure Segment Register Offset */
#define UHPHS_PERIODICLISTBASE_REG_OFST (0x24)              /**< (UHPHS_PERIODICLISTBASE) UHPHS Periodic Frame List Base Address Register Offset */
#define UHPHS_ASYNCLISTADDR_REG_OFST   (0x28)              /**< (UHPHS_ASYNCLISTADDR) UHPHS Asynchronous List Address Register Offset */
#define UHPHS_CONFIGFLAG_REG_OFST      (0x50)              /**< (UHPHS_CONFIGFLAG) UHPHS Configured Flag Register Offset */
#define UHPHS_PORTSC_REG_OFST          (0x54)              /**< (UHPHS_PORTSC) UHPHS Port Status and Control Register (port = 0) Offset */
#define UHPHS_INSNREG00_REG_OFST       (0x90)              /**< (UHPHS_INSNREG00) EHCI Specific Registers 00 Offset */
#define UHPHS_INSNREG01_REG_OFST       (0x94)              /**< (UHPHS_INSNREG01) EHCI Specific Registers 01 Offset */
#define UHPHS_INSNREG02_REG_OFST       (0x98)              /**< (UHPHS_INSNREG02) EHCI Specific Registers 02 Offset */
#define UHPHS_INSNREG03_REG_OFST       (0x9C)              /**< (UHPHS_INSNREG03) EHCI Specific Registers 03 Offset */
#define UHPHS_INSNREG04_REG_OFST       (0xA0)              /**< (UHPHS_INSNREG04) EHCI Specific Registers 04 Offset */
#define UHPHS_INSNREG05_REG_OFST       (0xA4)              /**< (UHPHS_INSNREG05) EHCI Specific Registers 05 Offset */
#define UHPHS_INSNREG06_REG_OFST       (0xA8)              /**< (UHPHS_INSNREG06) EHCI Specific Registers 06 Offset */
#define UHPHS_INSNREG07_REG_OFST       (0xAC)              /**< (UHPHS_INSNREG07) EHCI Specific Registers 07 Offset */

